# Carter Minter
## Week 14
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np
from pandas import Series,DataFrame
import pandas as pd

In [2]:
#mapping
df = DataFrame({'city':['Alma', 'Brian Head', 'Fox Park', 'Lake Mary'],
               'altitude': [10335,9800,9062,8966]})

df

         city  altitude
0        Alma     10335
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map={'Alma':'Colorado', 'Brian Head':'Utah', 'Fox Park':'Wyoming', 'Lake Mary':'California'}

In [4]:
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [6]:
df['state']=df['city'].map(st_map)

In [7]:
df

         city  altitude       state
0        Alma     10335    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [9]:
#apply 
def meter(x):
    return x / 3.308

In [10]:
df['altitude'] = df['altitude'].apply(meter)
df

         city     altitude       state
0        Alma  3124.244256    Colorado
1  Brian Head  2962.515115        Utah
2    Fox Park  2739.419589     Wyoming
3   Lake Mary  2710.399033  California

In [11]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index=['UT','OH','TX','OR'])

In [12]:
df

           b         d         e
UT -0.178987  1.541715 -1.089793
OH  0.375814 -1.079414 -0.142802
TX -1.025343 -0.537711 -0.703671
OR -0.786675  2.425198 -0.269842

In [13]:
def dif(x):
    return x.max()-x.min()

In [14]:
df.apply(dif)

b    1.401157
d    3.504612
e    0.946990
dtype: float64

In [15]:
df.apply(dif, axis=1)

UT    2.631508
OH    1.455228
TX    0.487632
OR    3.211873
dtype: float64

In [17]:
df.apply(pd.value_counts).fillna(0)

             b    d    e
-1.089793  0.0  0.0  1.0
-1.079414  0.0  1.0  0.0
-1.025343  1.0  0.0  0.0
-0.786675  1.0  0.0  0.0
-0.703671  0.0  0.0  1.0
-0.537711  0.0  1.0  0.0
-0.269842  0.0  0.0  1.0
-0.178987  1.0  0.0  0.0
-0.142802  0.0  0.0  1.0
 0.375814  1.0  0.0  0.0
 1.541715  0.0  1.0  0.0
 2.425198  0.0  1.0  0.0

In [21]:
#group by 
df = DataFrame({'k1': ['a', 'a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2':np.random.randn(5)})
df

  k1   k2  dataset1  dataset2
0  a  one -1.394450  0.683674
1  a  two -0.864171  0.185340
2  b  one -0.595065  0.032211
3  b  two -0.254319 -0.423077
4  c  one -0.806114 -0.050564

In [22]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [23]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [24]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [25]:
df['dataset1'].groupby(df['k1']).mean()

k1
a   -1.129310
b   -0.424692
c   -0.806114
Name: dataset1, dtype: float64

In [26]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a  -1.129310  0.434507
b  -0.424692 -0.195433
c  -0.806114 -0.050564

In [27]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one -1.394450  0.683674
   two -0.864171  0.185340
b  one -0.595065  0.032211
   two -0.254319 -0.423077
c  one -0.806114 -0.050564

In [ ]:
df.groupby(['k1','k2']).mean()